Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 64, 64, 3)]       0         
_________________________________________________________________

		***13 convolutional layers***
_________________________________________________________________

block5_pool (MaxPooling2D)   (None, 2, 2, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 2048)              0         
_________________________________________________________________
dense (Dense - relu)                (None, 256)               524544    
_________________________________________________________________
dense_1 (Dense - softmax)              (None, 43)                11051     
=================================================================
Total params: 15,250,283
Trainable params: 535,595
Non-trainable params: 14,714,688